api/app/controllers/puzzles_controller.rb

    def index
        @puzzles = Puzzle.all
---
SELECT "puzzles".* FROM "puzzles"

    def create
        @puzzle = Puzzle.new(puzzle_params)
        if @puzzle && @puzzle.save
---
INSERT INTO "puzzles" ("name", "pieces", "missing_pieces", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "some puzzle"], ["pieces", 1000], ["missing_pieces", 0], ["user_id", 3], ["created_at", "2018-04-07 20:57:11.541682"], ["updated_at", "2018-04-07 20:57:11.541682"]]

    def update
        if @puzzle.update(puzzle_params) && @puzzle.errors.empty?
---
UPDATE "puzzles" SET "missing_pieces" = $1, "updated_at" = $2 WHERE "puzzles"."id" = $3  [["missing_pieces", 2], ["updated_at", "2018-04-10 20:43:03.864134"], ["id", 8]]

    def destroy
        name = @puzzle.name
        @puzzle.delete
---
DELETE FROM "puzzles" WHERE "puzzles"."id" = $1  [["id", 3]]

    def set_puzzle
        @puzzle = Puzzle.find(params[:id])
---
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]