api/app/controllers/users_controller.rb

    def index
        users = User.all
---
SELECT "users".* FROM "users"

    def create
        user = User.new(user_params)
        if user.valid? && user.save
---
INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def find
        @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@testing.com"], ["LIMIT", 1]]

    def set_user
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]